{
  "https://old.reddit.com/r/Tekken/comments/y3ejlf/is_dragunov_worth_picking_up_as_a_beginner": [
    "\nIve seen lots of stuff about how he is weaker or mid tier due to power creep and some nerfs. Obviously as a newbie this probably won't affect me\n\ncorrect. \n\nShould I just disregard this entirely and just play him?\n\nabsolutely. if you like the character, his playstyle and buttons, definitely go for him.\n",
    "Yes\nto sum up :\n\nmedium execution\nlow risk / medium reward\nno major weakness ( no magic4, no hopkick)\nversatile (offensive & defensive)\nlot of tutos on YT\n\nGo for him...\nEven if you dont main him, it's good for you to learn Drag becoz you will face him in many fights ( many players use Drag as a secondary)\n",
    "\nno major weakness ( no magic4, no hopkick)\n\nThis I disagree with. He has much more pronounced weaknesses than most characters do, IMO.\n\nd+2 is his best low, and it isn't scary at all\nHitboxes are atrocious, arguably the worst in the game (WS+4 is his only reliable mid)\nVery steppable (d/f+3+4 is his only mid homing move, and still nobody uses it because it kinda sucks)\n\nBut it's fine for a character to have weaknesses, the others should be more like Drag.\n",
    "Yes\n",
    "Play him if you like him, he's a good character to learn. Also, those weaknesses that he has won't be able to be exploited by people until you get into the higher ranks so you won't even notice.\n",
    "Go for him ,  for learning fundamental he is one of the best with kazumi and jack.\nat red rank it's difficult because it's lacking CH tool but for rank under red it's fine and very fun.\n",
    "Join the church brother\n"
  ],
  "https://old.reddit.com/r/NeuralDSP/comments/17uiupp/sound_card_question": [
    "No one uses sound cards anymore. USB interfaces are standard. They start at around $60 for a budget model. More expensive interfaces can have less latency but you're probably OK with an inexpensive one for now. The sound will be close for guitar. All depends what computer/interface you're currently using but in most cases interfaces are necessary.\n",
    "Ah, so my Volt 2 is doing the work in place of a sound card essentially?\n",
    "Yes it is\n",
    "Cheers, much obliged.\n",
    "I am on Mac, use a 2nd Gen Focusrite with M Audio StudioPro 3s and all the plugins I have (6 of them) sound great. Both Bass and Guitar.\n",
    "So I’m good as is? I was going to get focusrite but I had read it doesn’t have midi ports and I like to use midi controller for synths n such so I got a Volt 2.\n",
    "Should be! I actually got a USB to MIDI cable for my keyboard but haven’t fucked with it yet. I eventually want to get a Volt too for the pre-amps, but they all kinda do the trick.\n"
  ]
}